2024/07/17/til-the-most-powerful-one-line-program-in-the-world/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>TIL: The most powerful one-line program in the world | Simon Dobson</title>
<link rel="icon" href="../../../../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../../../../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono|Libre+Baskerville|Montserrat|Playfair+Display|Tangerine">
<link rel="stylesheet" href="../../../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../../../assets/css/code.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon&nbsp;Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../../../index.html">Home</a></li>
		    <li><a href="../../../../personal/">About&nbsp;me</a></li>
		    <li><a href="../../../../research/">Research</a></li>
		    <li><a href="../../../../development/projects/">Software</a></li>
		    <li><a href="../../../../writing/">Writing</a></li>
		    <li><a href="../../../../personal/contact/">Contact</a></li>
		<li>
<a href="../../../../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<div class="entry-meta">
	    <span class="posted-on">
		Posted on <a href="." rel="bookmark">Wednesday 17 July, 2024</a>
	    </span>
	</div>
	<h1><span class="caps">TIL</span>: The most powerful one-line program in the&nbsp;world</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-orge9df00b" class="outline-2">
<h2 id="orge9df00b"><span class="caps">TIL</span>: The most powerful one-line program in the&nbsp;world</h2>
<div class="outline-text-2" id="text-orge9df00b">
<p>
Well, the most powerful I&#8217;ve found so far,&nbsp;anyway.
</p>

<p>
Given my current obsession with <a href="/categories/lisp/">Lisp</a> you might reasonably expect it
to be in that language. But it isn&#8217;t: it&#8217;s in <a href="https://en.wikipedia.org/wiki/APL_(programming_language)"><span class="caps">APL</span></a>, and it performs
one complete generation of <a href="https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life">Conway&#8217; Game of Life</a> in one line of&nbsp;code:
</p>

<div class="highlight"><pre><span></span>  Life←{↑↑1 ⍵∨.∧3 4=+/,¯1 0 1∘.⊖¯1 0 1∘.⌽⊂⍵}
</pre></div>

<p>
…and does so inexplicably to anyone who doesn&#8217;t know <span class="caps">APL</span>,
obviously, but the <a href="https://aplwiki.com/wiki/John_Scholes%27_Conway%27s_Game_of_Life">basic algorithm</a> is&nbsp;simple:
</p>

<ol class="org-ol">
<li>Take an array with 1 in each occupied cell and 0&nbsp;elsewhere</li>
<li>Build four new arrays by exchanging each element with its
neighbour up, down, left, and&nbsp;right</li>
<li>Sum these arrays, which places the number of neighbours into each&nbsp;cell</li>
<li>Cut-off these values to be 1 if the cell has a value of 3 or 4,
and 0&nbsp;otherwise</li>
<li>Re-format the arrays back into the starting&nbsp;configuration</li>
</ol>
<p>
I checked it out using <a href="https://www.gnu.org/software/apl/"><span class="caps">GNU</span> <span class="caps">APL</span></a> and it works&nbsp;fine.
</p>

<p>
I discovered this gem by accident, actually implemented <a href="https://github.com/chmykh/apl-life">in <span class="caps">APL</span> in
Forth</a> where someone has developed <span class="caps">APL</span> as an embedded <span class="caps">DSL</span> within
<a href="https://en.wikipedia.org/wiki/Forth_(programming_language)">Forth</a> (another language with which I have history). After a bit of
digging I found a similar <span class="caps">APL</span> in Lisp, <a href="https://github.com/phantomics/april">April</a>, which clearly needs&nbsp;exploring.
</p>

<p>
In many ways <span class="caps">APL</span> and Lisp are parallel tracks within programming
language evolution, taking a single data structure (lists or arrays)
and providing powerful ways to manipulate them. Lisp of course has
been extended with other data structures, including arrays, which
makes the fusion of array- and list-based programming rather&nbsp;attractive.
</p>

<p>
I can&#8217;t help asking myself what would have happened if <span class="caps">APL</span> hadn&#8217;t
fallen by the wayside. (I think this was inevitable, incidentally,
once the syntax became fixed: any language that requires its own
character set was always going to struggle.) We now have huge
applications for array processing, from graphics to machine
learning, and GPUs are from one perspective just <span class="caps">APL</span> accelerator
co-processors. The ideas are still massively&nbsp;relevant.
</p>
</div>
</div>
	    </div>


	</article>
</div>

	<!-- Social sharing section -->
  <div class="site-content">
    <div class="social">
      <ul>
<li><a onclick="MastodonShare(this);" data-src="TIL%3A%20The%20most%20powerful%20one-line%20program%20in%20the%20world%20%23apl%20%23programming%20%23til&amp;url=https://simondobson.org/2024/07/17/til-the-most-powerful-one-line-program-in-the-world/"><span title="Share on Mastodon"><i class="fab fa-mastodon"></i></span></a></li>
	<li><a href="https://twitter.com/share?text=TIL%3A%20The%20most%20powerful%20one-line%20program%20in%20the%20world%20%23apl%20%23programming%20%23til&amp;url=https://simondobson.org/2024/07/17/til-the-most-powerful-one-line-program-in-the-world/" target="_blak"><span title="Share on Twitter"><i class="fab
	fa-twitter"></i></span></a></li>
	<li><a href="https://www.reddit.com/submit?url=https://simondobson.org/2024/07/17/til-the-most-powerful-one-line-program-in-the-world/&amp;title=TIL%3A%20The%20most%20powerful%20one-line%20program%20in%20the%20world%20%23apl%20%23programming%20%23til" target="_blank"><span title="Share on Reddit"><i class="fab fa-reddit"></i></span></a></li>
	<li><a href="https://www.linkedin.com/shareArticle?url=https://simondobson.org/2024/07/17/til-the-most-powerful-one-line-program-in-the-world/&amp;source=https://simondobson.org/" target="_blank"><span title="Share on LinkedIn"><i class="fab fa-linkedin"></i></span></a></li>
	<li><a href="mailto:?subject=TIL:%20The%20most%20powerful%20one-line%20program%20in%20the%20world&amp;body=https://simondobson.org/2024/07/17/til-the-most-powerful-one-line-program-in-the-world/"><span title="Share by email"><i class="fa fa-envelope"></i></span></a></li>
      </ul>
</div>
  </div>

	<!-- Tag Section -->
    <div class="site-content navigation-post">
	<div class="tag-head">Tags</div>
	<div class="tag-list">
		<a href="../../../../categories/apl/">apl</a>
		    <span>  </span>
		<a href="../../../../categories/programming/">programming</a>
		    <span>  </span>
		<a href="../../../../categories/til/">til</a>
	</div>
    </div>

	<!-- Post Navigation links -->
<nav class="site-content navigation-post" role="navigation"><div class="previous">
	    <a href="../../../../goodreads/notes-on-complexity-a-scientific-theory-of-connection-consciousness-and-being/" rel="prev">
		<span class="meta-nav">Older Post</span>Notes on Complexity: A Scientific Theory of Connection, Consciousness, and Being
	    </a>
	</div>
	<div class="next">
	    <a href="../../23/the-roots-of-lisp/" rel="next">
		<span class="meta-nav">Newer Post</span>The roots of Lisp
	    </a>
	</div>
</nav><!-- Page Footer --><section class="footer-sidebar clear" role="complementary"><div class="widget-block">
	    <aside class="widget"><h2 class="widget-title">Simon&nbsp;Dobson</h2>
		<div class="widget-text">Aut tace aut loquere meliora silentio</div>
	    </aside>
</div>
    </section><!-- Extra JavaScript --><script src="../../../../assets/js/mastodon-share.js"></script><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
	    <p></p>
	    <p>
	      Built with free and open-source software.
	      Powered by <a href="https://getnikola.com/">Nikola</a> using a theme based on
	      <a href="https://themes.getnikola.com/v7/libretto/">Libretto</a>.
	    </p>
	    <p>
	      All content Copyright © 2010–2024 Simon Dobson and licensed under
	      <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/"><span class="caps">CC</span>-<span class="caps">BY</span>-<span class="caps">NC</span>-<span class="caps">SA</span>-4.0</a>
	      unless otherwise&nbsp;noted.
	    </p>
	</div>
	<div class="social">
	    <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>